mercando-rest/src/main/resources/soap_envelopes/soapClients-getPlayer.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.services.training.expert.backbase.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:getPlayer>
         <username>%%username%%</username>
      </web:getPlayer>
   </soapenv:Body>
</soapenv:Envelope>